import React from "react";

import image1 from "../assets/reviewpro1.svg";
import image2 from "../assets/reviewpro2.svg";
import image3 from "../assets/reviewpro3.svg";
import planetimage from "../assets/review-component-planet.svg";
import lampimg from "../assets/casual-life-3d-idea-lamp 1.svg";
const StudentsReview: React.FC = () => {
  return (
    <div className="student-review-component-container">
      <div className="header">
        <h1>сурагчдын сэтгэгдэл</h1>
        <p>Lorem Ipsum is simply dummy text of the printing.</p>
      </div>
      <div className="three-reviews">
        <div className="review">
          <p>
            Багш нар маань зөвхөн мэдлэгээ заах төдийгүй, сурагчдын сэтгэхүйг
            хөгжүүлж, аливаа асуудлыг өөрийнхөөрөө шийдвэрлэх чадварыг нь
            хөгжүүлдэг.
          </p>
          <div className="profile">
            <img src={image1} alt="" />
            <div className="texts">
              <h1>Oyun-bold</h1>
              <p>Web Developer</p>
            </div>
          </div>
        </div>
        <div className="review">
          <p>
            Тэд зөвхөн хичээл заадаг хүн биш, сурагч бүрийг урамшуулж, сонирхлыг
            нь төрүүлж, суралцах хүсэл эрмэлзлийг нь нэмэгдүүлдэг.
          </p>
          <div className="profile">
            <img src={image2} alt="" />
            <div className="texts">
              <h1>Badar-Uugan</h1>
              <p>Web design</p>
            </div>
          </div>
        </div>
        <div className="review">
          <p>
            багш маань хичээлээ сонирхолтой, амьд жишээ дээр үндэслэн заадаг тул
            ойлгоход хялбар, практикт шууд хэрэглэж болох мэдлэгийг олж авдаг.
          </p>
          <div className="profile">
            <img src={image3} alt="" />
            <div className="texts">
              <h1>Enkhjin</h1>
              <p>Ui&Ux Design</p>
            </div>
          </div>
        </div>
      </div>
      <svg
        className="review-swipe"
        xmlns="http://www.w3.org/2000/svg"
        width="126"
        height="14"
        viewBox="0 0 126 14"
        fill="none"
      >
        <circle cx="90" cy="7" r="7" fill="#C2C2C2" />
        <circle cx="119" cy="7" r="7" fill="#C2C2C2" />
        <circle cx="61" cy="7" r="7" fill="#C2C2C2" />
        <rect y="1" width="39" height="12" rx="6" fill="#4D2C5E" />
      </svg>
      <div className="review-form-container">
        <svg
          className="review-curly-arrow-img"
          xmlns="http://www.w3.org/2000/svg"
          width="169"
          height="174"
          viewBox="0 0 169 174"
          fill="none"
        >
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M151.649 106.573C150.669 105.632 149.121 105.638 148.16 106.572C136.647 117.397 124.489 122.87 112.06 122.944C99.957 123.014 87.6986 117.817 75.6411 107.585C72.9611 105.352 68.8116 100.708 65.1531 95.2329C68.17 90.9712 70.1672 85.9161 71.1391 81.0409C72.5726 73.8406 71.4579 67.2074 69.0049 63.9122C67.6457 62.0875 65.9004 60.9646 63.8647 60.4896C61.259 59.8852 57.7264 60.3937 53.6884 63.737C48.1174 68.3716 46.7962 75.0238 48.5125 82.3615C49.4189 86.2189 51.2265 90.2714 53.4714 94.1684C50.9127 96.1608 47.7213 97.3044 43.8265 96.8662C35.5824 95.9934 29.3653 89.348 24.9248 81.5443C21.0738 74.7932 16.4235 64.8254 17.5899 56.9305C17.9847 54.2476 19.1727 51.9462 16.8925 49.7399C13.4013 46.3264 10.2405 49.8244 9.69292 53.5093C8.5208 61.4254 11.4667 70.9839 14.3615 78.3073C19.6744 91.7841 29.566 103.932 42.8349 105.669C49.0552 106.456 54.3199 104.868 58.5742 101.888C62.6622 107.41 67.0629 111.984 69.9461 114.283C84.2113 125.433 98.5322 130.659 112.354 129.948C126.162 129.244 139.518 122.685 151.687 109.984C152.639 109.036 152.629 107.515 151.649 106.573ZM59.4226 84.5236C58.547 82.2838 57.9513 80.0847 57.7679 77.9957C57.5393 75.3391 58.0486 72.8794 60.1554 71.1405C60.5125 70.8504 60.947 70.4449 61.304 70.1548C61.5794 71.0783 62.057 72.8945 62.0728 74.3949C62.0923 77.7437 61.3372 81.7246 59.7961 85.4279C59.6472 85.1162 59.5281 84.8237 59.4226 84.5236Z"
            fill="#4D2C5E"
          />
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M61.6775 69.996C61.9215 70.1293 62.1552 70.2144 62.1355 70.0273C62.1053 69.7921 61.944 69.8285 61.6775 69.996Z"
            fill="#4D2C5E"
          />
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M144.868 111.456C143.754 113.915 142.678 116.532 141.915 119.028C140.74 122.924 140.248 126.49 141.249 129.094C141.564 130.392 142.905 131.203 144.222 130.896C145.546 130.603 146.362 129.301 146.033 128.01C145.961 127.367 146.187 126.702 146.399 125.953C146.885 124.188 147.984 122.349 149.18 120.365C150.71 117.835 152.552 115.309 154.123 112.971C155.552 110.857 156.743 108.894 157.499 107.337C158.692 104.888 158.745 102.826 158.464 101.617C158.386 101.301 155.68 96.5977 151.11 98.4418C149.477 99.1064 145.43 100.999 145.23 101.093C142.799 102.385 138.284 104.72 133.978 105.931C132.617 106.316 131.303 106.658 130.104 106.701C130.04 106.593 129.975 106.485 129.898 106.385C128.768 104.825 126.588 104.447 124.996 105.52C124.113 106.033 122.967 107.486 122.663 108.358C122.08 110.051 122.748 111.421 124.375 112.558C126.591 114.102 129.787 114.557 133.374 114.289C137.145 113.99 141.411 112.712 144.868 111.456ZM148.805 103.601C149.07 103.093 149.158 102.72 148.797 102.634C148.392 102.538 148.665 103.212 148.805 103.601Z"
            fill="#4D2C5E"
          />
        </svg>
        <img src={planetimage} alt="" className="review-planets-img" />
        <div className="yourname container">
          <h1>Your Name</h1>
          <input type="text" name="input" className="your-name" />
        </div>
        <div className="emailaddress container">
          <h1 className="two">Email Address</h1>
          <input name="input" type="text" className="email-address" />
        </div>
        <div className="mobilenumber container">
          <h1 className="three">Mobile Number</h1>
          <input name="input" type="text" className="mobile-number" />
        </div>
        <div className="yourquery container">
          <h1 className="four">Your Query</h1>
          <input name="input" type="text" className="your-query" />
        </div>
        <button className="review-form-btn">send</button>
      </div>
      <div className="subscribe-to-newsletter-container">
        <svg
          className="orange-arrow"
          xmlns="http://www.w3.org/2000/svg"
          width="169"
          height="173"
          viewBox="0 0 169 173"
          fill="none"
        >
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M151.649 106.23C150.669 105.289 149.121 105.295 148.16 106.229C136.647 117.054 124.489 122.527 112.06 122.601C99.957 122.671 87.6986 117.474 75.6411 107.242C72.9611 105.008 68.8116 100.365 65.1531 94.8896C68.17 90.6279 70.1672 85.5728 71.1391 80.6976C72.5726 73.4973 71.4579 66.8641 69.0049 63.5689C67.6457 61.7443 65.9004 60.6213 63.8647 60.1463C61.259 59.542 57.7264 60.0505 53.6884 63.3938C48.1174 68.0283 46.7962 74.6805 48.5125 82.0182C49.4189 85.8756 51.2265 89.9281 53.4714 93.8251C50.9127 95.8175 47.7213 96.9611 43.8265 96.523C35.5824 95.6501 29.3653 89.0047 24.9248 81.201C21.0738 74.45 16.4235 64.4822 17.5899 56.5873C17.9847 53.9043 19.1727 51.603 16.8925 49.3966C13.4013 45.9832 10.2405 49.4812 9.69292 53.1661C8.5208 61.0821 11.4667 70.6406 14.3615 77.964C19.6744 91.4409 29.566 103.589 42.8349 105.326C49.0552 106.112 54.3199 104.524 58.5742 101.545C62.6622 107.067 67.0629 111.641 69.9461 113.94C84.2113 125.09 98.5322 130.315 112.354 129.604C126.162 128.901 139.518 122.342 151.687 109.641C152.639 108.693 152.629 107.172 151.649 106.23ZM59.4226 84.1803C58.547 81.9406 57.9513 79.7415 57.7679 77.6524C57.5393 74.9959 58.0486 72.5362 60.1554 70.7973C60.5125 70.5071 60.947 70.1017 61.304 69.8115C61.5794 70.7351 62.057 72.5513 62.0728 74.0516C62.0923 77.4004 61.3372 81.3814 59.7961 85.0847C59.6472 84.7729 59.5281 84.4805 59.4226 84.1803Z"
            fill="#FF7426"
          />
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M61.6775 69.6528C61.9215 69.786 62.1552 69.8711 62.1355 69.6841C62.1053 69.4488 61.944 69.4853 61.6775 69.6528Z"
            fill="#FF7426"
          />
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M144.868 111.112C143.754 113.572 142.678 116.189 141.915 118.685C140.74 122.58 140.248 126.147 141.249 128.751C141.564 130.048 142.905 130.86 144.222 130.553C145.546 130.26 146.362 128.957 146.033 127.667C145.961 127.024 146.187 126.358 146.399 125.61C146.885 123.845 147.984 122.005 149.181 120.022C150.71 117.491 152.552 114.965 154.123 112.628C155.552 110.513 156.743 108.551 157.499 106.994C158.692 104.545 158.745 102.483 158.464 101.274C158.386 100.958 155.68 96.2545 151.11 98.0985C149.477 98.7631 145.43 100.656 145.23 100.75C142.799 102.041 138.284 104.376 133.978 105.587C132.617 105.973 131.303 106.315 130.104 106.358C130.04 106.25 129.975 106.142 129.898 106.042C128.768 104.482 126.588 104.104 124.996 105.177C124.113 105.69 122.967 107.143 122.663 108.014C122.08 109.708 122.748 111.077 124.375 112.215C126.591 113.759 129.787 114.214 133.374 113.945C137.145 113.647 141.411 112.368 144.868 111.112ZM148.805 103.258C149.07 102.75 149.158 102.376 148.797 102.291C148.392 102.195 148.665 102.869 148.805 103.258Z"
            fill="#FF7426"
          />
        </svg>
        <img src={lampimg} alt="" className="lampi" />
        <h1>Subscribe to our newsletter</h1>
        <p>Lorem Ipsum is simply dummy text of the printing.</p>
        <div className="input-container">
          <input type="text" placeholder="Email Address" />
          <button className="send-button">Send</button>
        </div>
      </div>
    </div>
  );
};

export default StudentsReview;
